# Solving SQL Question using Pandas

In [19]:
import pandas as pd

df1 = pd.read_csv('/Users/shiyuzhang/Desktop/Copy of SQL - t1 name_country.csv')
df2 = pd.read_csv('/Users/shiyuzhang/Desktop/Copy of SQL - t2 name_amount.csv')

In [20]:
df1.head()

        name    country
0      Karen    Armenia
1  Alexandra  Australia
2       Aman  Australia
3       Bill  Australia
4    Brandon  Australia

In [21]:
df2.head()

       name   amount
0     Aaron  $17,200
1     Abdul     $300
2  Abhishek   $4,200
3      Adam  $30,800
4    Aditya     $500

### Full outer join two Data Frames using 'name' as key :

In [22]:
df_merge = pd.merge(df1,
                 df2,
                 on='name', 
                 how='outer', 
                 )
df_merge.head()

        name    country  amount
0      Karen    Armenia  $9,900
1  Alexandra  Australia    $700
2       Aman  Australia    $300
3       Bill  Australia  $4,700
4    Brandon  Australia  $6,000

### Check data types of all columns:

In [37]:
df_merge.dtypes

name       object
country    object
amount     object
dtype: object

In [44]:
# We can see that the 'amount' columns's datatype is 'object', it should be numeric, we need to change the data type
# Inorder to change 'amount' to numeric, we need to remove the '$' and ',' sign first
df_merge['amount']=df_merge['amount'].replace('\$','',regex = True)
df_merge['amount']=df_merge['amount'].replace('\,','',regex = True)
df_merge.head()

        name    country amount
0      Karen    Armenia   9900
1  Alexandra  Australia    700
2       Aman  Australia    300
3       Bill  Australia   4700
4    Brandon  Australia   6000

In [46]:
df_merge['amount'] = pd.to_numeric(df_merge['amount'])

In [47]:
df_merge.dtypes['amount']

dtype('int64')

### Display countries which total amount is more than 100,000

In [49]:
total = df_merge.groupby('country')['amount'].sum()
total

country
Armenia                   9900
Australia                30700
Austria                  25000
Belarus                   2200
Belgium                  46100
Brazil                   28300
Bulgaria                  4600
Cambodia                 11600
Canada                  150700
Chile                    17800
China                     4400
Costa Rica                3600
Croatia                   4500
Cyprus                    2500
Denmark                 100700
Ecuador                   6800
Estonia                   2700
Finland                   8400
France                    5600
Greece                   11300
Guatemala                 2700
Hong Kong                89700
Hungary                   7700
India                    39300
Ireland                 129800
Italy                    29700
Jamaica                  12100
Japan                    44500
Malaysia                 10100
Malta                    25800
Mauritius                 7200
New Zealand             201300
Norway                    8300
Panama                    2300
Paraguay                  2500
Peru                      8600
Poland                    1400
Portugal                 32600
Puerto Rico              10700
Saudi Arabia              5200
Serbia                    2400
Singapore                 5100
Slovenia                  1400
South Africa             85500
Spain                    38400
Sweden                   78100
Switzerland             115700
Thailand                 25200
Ukraine                   6200
United Arab Emirates      7200
United Kingdom           87500
United States           179400
Uruguay                    400
Viet Nam                   100
Name: amount, dtype: int64